[
  {
    "title": "What are the easiest vegetables to grow in pots on a balcony?",
    "content": "I'm new to gardening and have a small sunny balcony. I'd love to grow some of my own food but I'm not sure where to start. What are some forgiving plants for beginners that do well in containers?"
  },
  {
    "title": "How often should I water my indoor herbs?",
    "content": "I have some indoor herbs like mint, basil, and parsley on my kitchen windowsill. I'm always worried about over or under-watering them. Is there a general rule of thumb for how often they need water?"
  },
  {
    "title": "Help! My plant leaves have brown, crispy spots. What could it be?",
    "content": "One of my houseplants has started developing brown, dry spots on its leaves, especially around the edges. I've already tried the AI diagnosis tool but wanted to get the community's opinion too. Has anyone seen this before?"
  },
  {
    "title": "Best way to make compost at home without it smelling?",
    "content": "I want to start a compost bin for my kitchen scraps but I'm worried about it attracting pests or smelling bad. What are your best tips for maintaining a clean and odor-free compost system?"
  },
  {
    "title": "I have a ton of zucchini from my garden! Any creative recipe ideas?",
    "content": "My zucchini plant has gone wild and now I have more than I know what to do with! I've already made soup and bread. Does anyone have any unique or creative recipe ideas to use them up?"
  },
  {
    "title": "What's the best way to store fresh herbs to make them last longer?",
    "content": "Whenever I buy or harvest fresh herbs like cilantro or parsley, they seem to wilt in the fridge within a couple of days. What's the best method to keep them fresh for a week or more?"
  },
  {
    "title": "Companion planting recommendations for a small vegetable patch?",
    "content": "I have a small raised bed and I've heard that companion planting can help deter pests and improve growth. What are some good plant pairings for common vegetables like tomatoes, peppers, and carrots?"
  },
  {
    "title": "Does anyone know if the AI recipe generator considers allergies?",
    "content": "I have a peanut allergy and I was wondering if there's a way to tell the AI recipe generator in the 'My Kitchen' section to avoid certain ingredients. Is this a feature?"
  },
  {
    "title": "What's everyone's favorite 'zero-waste' kitchen hack?",
    "content": "I'm always looking for new ways to reduce waste in the kitchen. What are some of your favorite tips or tricks? For example, I like to use vegetable scraps to make my own broth."
  },
  {
    "title": "My first attempt at growing carrots was a failure. What did I do wrong?",
    "content": "I tried growing carrots for the first time and when I harvested them, they were tiny and twisted. My soil might be too dense. Does anyone have tips for getting long, straight carrots?"
  }
]